In [227]:
import pandas as pd
import numpy as np

data_file = "purchase_data.csv"
data_file_df = pd.read_csv(data_file)
data_file_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [228]:
total_players = data_file_df.loc[:, ["Gender", "SN", "Age"]]
total_players = total_players.drop_duplicates()
total_players.head()
players_count=total_players.count()[0]
pd.DataFrame({"Total Number of Players": [players_count]})

   Total Number of Players
0                      576

In [229]:
average_price = data_file_df["Price"].mean()
average_price =round(average_price,2)

average_price

3.05

In [230]:
Total_revenue = data_file_df["Price"].sum()
# Total_revenue= pd.DataFrame({"Total Revenue": [Total_revenue]})
Total_revenue

2379.77

In [231]:
Total_purchase_quantity = data_file_df["Purchase ID"].count()

Total_purchase_quantity

780

In [232]:
unique_items_count = len(data_file_df["Item Name"].unique())
unique_items_count

179

In [233]:
purchase_analysis = pd.DataFrame({"Number of Unique Items":[unique_items_count], 
                                  "Average Price in Dollars":[average_price],
                                  "Number of Purchases": [Total_purchase_quantity],
                                  "Total Revenue in Dollars": [Total_revenue]})
purchase_analysis= purchase_analysis.set_index("Number of Unique Items")
purchase_analysis ["Average Price in Dollars"] = purchase_analysis["Average Price in Dollars"].map("${:,.2f}".format)
purchase_analysis ["Total Revenue in Dollars"] = purchase_analysis["Total Revenue in Dollars"].map("${:,.2f}".format)
purchase_analysis

,Average Price in Dollars,Number of Purchases,Total Revenue in Dollars
Number of Unique Items,,,
179,$3.05,780,"$2,379.77"

In [234]:
gender_count = total_players["Gender"].value_counts()



gender_count

Male                     484
Female                    81
Other / Non-Disclosed     11
Name: Gender, dtype: int64

In [235]:
gender_percentage = gender_count/ players_count

gender_percentage

Male                     0.840278
Female                   0.140625
Other / Non-Disclosed    0.019097
Name: Gender, dtype: float64

In [236]:
gender_analysis_df=pd.DataFrame({"Gender Count": gender_count, "Gender Percentage": gender_percentage})
gender_analysis_df["Gender Percentage"]=gender_analysis_df["Gender Percentage"].map("{:,.2%}".format)
gender_analysis_df

                       Gender Count Gender Percentage
Male                            484            84.03%
Female                           81            14.06%
Other / Non-Disclosed            11             1.91%

In [237]:
gender_total_price=data_file_df.groupby(["Gender"]).sum()["Price"].rename("Total Revenue")
gender_total_price

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Total Revenue, dtype: float64

In [238]:
gender_average=data_file_df.groupby(["Gender"]).mean()["Price"].rename("Average Purchase Price")
gender_average

Gender
Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
Name: Average Purchase Price, dtype: float64

In [239]:
gender_purchase_quantity = data_file_df.groupby(["Gender"]).count()["Price"].rename("Purchase Count")
gender_purchase_quantity

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Purchase Count, dtype: int64

In [240]:
avg_per_person_total = gender_total_price/ gender_analysis_df["Gender Count"]
avg_per_person_total

Female                   4.468395
Male                     4.065372
Other / Non-Disclosed    4.562727
dtype: float64

In [241]:
gender_df= pd.DataFrame({"Purchase Count": gender_purchase_quantity, "Average Purchase Price": gender_average, "Total Revenue": gender_total_price, "Normalized Totals": avg_per_person_total})
gender_df

,Purchase Count,Average Purchase Price,Total Revenue,Normalized Totals
Gender,,,,
Female,113,3.203009,361.94,4.468395
Male,652,3.017853,1967.64,4.065372
Other / Non-Disclosed,15,3.346000,50.19,4.562727

In [242]:
gender_df["Average Purchase Price"]= gender_df["Average Purchase Price"].map("${:,.2f}".format)
gender_df["Total Revenue"]=gender_df["Total Revenue"].map("${:,.2f}".format)
gender_df["Purchase Count"]=gender_df["Purchase Count"].map("{:,}".format)
gender_df["Average Total Purchase/ Person"]= gender_df["Normalized Totals"].map("${:,.2f}".format)
gender_df=gender_df.loc[:, ["Purchase Count", "Average Purchase Price", "Total Revenue", "Average Total Purchase/ Person"]]
gender_df

,Purchase Count,Average Purchase Price,Total Revenue,Average Total Purchase/ Person
Gender,,,,
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,"$1,967.64",$4.07
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

In [243]:
bins = [0, 9.9, 14.9, 19.9, 24.9, 29.9, 34.9, 39.9, 140]
group_names = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

In [244]:
total_players["Age Ranges"]=pd.cut(total_players["Age"], bins, labels=group_names)

In [245]:
age_count=total_players["Age Ranges"].value_counts()
age_count

20-24    258
15-19    107
25-29     77
30-34     52
35-39     31
10-14     22
<10       17
40+       12
Name: Age Ranges, dtype: int64

In [246]:
age_percentages= age_count / players_count
age_percentages

20-24    0.447917
15-19    0.185764
25-29    0.133681
30-34    0.090278
35-39    0.053819
10-14    0.038194
<10      0.029514
40+      0.020833
Name: Age Ranges, dtype: float64

In [247]:
age_demographics=pd.DataFrame({"Total Count": age_count, "Percentage of Players": age_percentages})
age_demographics["Percentage of Players"]=age_demographics["Percentage of Players"].map("{:,.2%}".format)
age_demographics=age_demographics.sort_index()
age_demographics

       Total Count Percentage of Players
<10             17                 2.95%
10-14           22                 3.82%
15-19          107                18.58%
20-24          258                44.79%
25-29           77                13.37%
30-34           52                 9.03%
35-39           31                 5.38%
40+             12                 2.08%

In [248]:
age_analysis=data_file_df
age_analysis["Age Ranges"] = pd.cut(data_file_df["Age"], bins, labels=group_names)

age_totals=age_analysis.groupby(["Age Ranges"]).sum()["Price"].rename("Total Revenue")
age_average=age_analysis.groupby(["Age Ranges"]).mean()["Price"].rename("Average Purchase Price")
age_counts= age_analysis.groupby(["Age Ranges"]).count()["Price"].rename("Total Purchases")
normalized_total= age_totals/age_demographics["Total Count"]

age_df=pd.DataFrame({"Total Purchases": age_counts, "Average Purchase Price": age_average, "Total Revenue": age_totals, "Average Total Purchase/ Person": normalized_total})
age_df

,Total Purchases,Average Purchase Price,Total Revenue,Average Total Purchase/ Person
Age Ranges,,,,
<10,23,3.353478,77.13,4.537059
10-14,28,2.956429,82.78,3.762727
15-19,136,3.035956,412.89,3.858785
20-24,365,3.052219,1114.06,4.318062
25-29,101,2.900990,293.00,3.805195
30-34,73,2.931507,214.00,4.115385
35-39,41,3.601707,147.67,4.763548
40+,13,2.941538,38.24,3.186667

In [286]:
age_df["Average Purchase Price"]=age_df["Average Purchase Price"].map("${:,.2f}".format)
age_df["Total Revenue"]=age_df["Total Revenue"].map("${:,.2f}".format)
age_df["Total Purchases"]=age_df["Total Purchases"].map("{:,}".format)
age_df["Average Total Purchase/ Person"]=age_df["Average Total Purchase/ Person"].map("${:,.2f}".format)
age_df=age_df.loc[:, ["Pu"]]

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20-24,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40+,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,25-29,Male,92,Final Critic,4.88
3,3,Chamassasya86,25-29,Male,100,Blindscythe,3.27
4,4,Iskosia90,20-24,Male,131,Fury,1.44

In [287]:
top_spenders_df= data_file_df.sort_values("SN")

top_spenders_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
467,467,Adairialis76,15-19,Male,123,Twilight's Carver,2.28
142,142,Adastirin33,35-39,Female,175,Woeful Adamantite Claymore,4.48
388,388,Aeda94,15-19,Male,128,"Blazeguard, Reach of Eternity",4.91
28,28,Aela59,20-24,Male,119,"Stormbringer, Dark Blade of Ending Misery",4.32
630,630,Aelaria33,20-24,Male,171,Scalpel,1.79

In [288]:
spenders_vcount_df = top_spenders_df["SN"].value_counts()
spenders_vcount_df= pd.DataFrame(spenders_vcount_df)

spenders_vcount_df= spenders_vcount_df.rename(columns={(0): "SN", "SN": "Purchase Count"})
spenders_vcount_df= spenders_vcount_df.reset_index()
spenders_vcount_df= spenders_vcount_df.rename(columns={("index"): "SN", "Purchase Count": "Purchase Count"})
spenders_vcount_df

                 SN  Purchase Count
0         Lisosia93               5
1            Iral74               4
2       Idastidru52               4
3          Phyali88               3
4      Saedaiphos46               3
..              ...             ...
571          Aeri84               1
572        Raisty38               1
573     Assjaskan56               1
574  Frichirranya75               1
575      Quilassa66               1

[576 rows x 2 columns]

In [289]:
top_spenders_df= top_spenders_df.groupby(['SN'])
print(top_spenders_df)
top_spenders_df.count().head(10)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x111793090>

              Purchase ID  Age  Gender  Item ID  Item Name  Price
SN
Adairialis76            1    1       1        1          1      1
Adastirin33             1    1       1        1          1      1
Aeda94                  1    1       1        1          1      1
Aela59                  1    1       1        1          1      1
Aelaria33               1    1       1        1          1      1
Aelastirin39            2    2       2        2          2      2
Aelidru27               1    1       1        1          1      1
Aelin32                 3    3       3        3          3      3
Aelly27                 2    2       2        2          2      2
Aellynun67              1    1       1        1          1      1

In [294]:
spenders_avg_df=round((top_spenders_df["Price"].mean()),2)
spenders_avg_df= pd.DataFrame(spenders_avg_df)
spenders_avg_df= spenders_avg_df.rename(columns={"SN": "SN", "Price": "Average Purchase Price in Dollars"})
spenders_avg_df

               Average Purchase Price in Dollars
SN
Adairialis76                                2.28
Adastirin33                                 4.48
Aeda94                                      4.91
Aela59                                      4.32
Aelaria33                                   1.79
...                                          ...
Yathecal82                                  2.07
Yathedeu43                                  3.01
Yoishirrala98                               4.58
Zhisrisu83                                  3.94
Zontibe81                                   2.68

[576 rows x 1 columns]

In [295]:
top_spenders_analysis=pd.merge(spenders_vcount_df, spenders_avg_df, on="SN")

top_spenders_analysis

                 SN  Purchase Count  Average Purchase Price in Dollars
0         Lisosia93               5                               3.79
1            Iral74               4                               3.40
2       Idastidru52               4                               3.86
3          Phyali88               3                               3.43
4      Saedaiphos46               3                               2.94
..              ...             ...                                ...
571          Aeri84               1                               1.61
572        Raisty38               1                               3.27
573     Assjaskan56               1                               2.96
574  Frichirranya75               1                               4.23
575      Quilassa66               1                               4.23

[576 rows x 3 columns]

In [296]:
spenders_total_df=top_spenders_df["Price"].sum()
spenders_total_df= pd.DataFrame(spenders_total_df)
spenders_total_df= spenders_total_df.rename(columns={"SN": "SN", "Price": "Total Purchase Value in Dollars"})
spenders_total_df

               Total Purchase Value in Dollars
SN
Adairialis76                              2.28
Adastirin33                               4.48
Aeda94                                    4.91
Aela59                                    4.32
Aelaria33                                 1.79
...                                        ...
Yathecal82                                6.22
Yathedeu43                                6.02
Yoishirrala98                             4.58
Zhisrisu83                                7.89
Zontibe81                                 8.03

[576 rows x 1 columns]

In [297]:
top_spenders_analysis=pd.merge(top_spenders_analysis, spenders_total_df, on="SN")

top_spenders_analysis=top_spenders_analysis.set_index("SN")
top_spenders_analysis

,Purchase Count,Average Purchase Price in Dollars,Total Purchase Value in Dollars
SN,,,
Lisosia93,5,3.79,18.96
Iral74,4,3.40,13.62
Idastidru52,4,3.86,15.45
Phyali88,3,3.43,10.30
Saedaiphos46,3,2.94,8.83
...,...,...,...
Aeri84,1,1.61,1.61
Raisty38,1,3.27,3.27
Assjaskan56,1,2.96,2.96
Frichirranya75,1,4.23,4.23
Quilassa66,1,4.23,4.23

In [331]:
data_file_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20-24,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40+,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,25-29,Male,92,Final Critic,4.88
3,3,Chamassasya86,25-29,Male,100,Blindscythe,3.27
4,4,Iskosia90,20-24,Male,131,Fury,1.44

In [343]:
pop_items_df= data_file_df.sort_values("Item ID")

pop_items_df.head()

     Purchase ID          SN    Age Gender  Item ID Item Name  Price
204          204  Chamimla85  15-19   Male        0  Splinter   1.28
662          662  Mindilsa60  20-24   Male        0  Splinter   1.28
133          133    Phaena87  20-24   Male        0  Splinter   1.28
150          150    Inasti31  15-19   Male        0  Splinter   1.28
121          121    Ilosia37  20-24   Male        1  Crucifer   3.26

In [344]:
pop_count_df = pop_items_df["Item ID"].value_counts()
pop_count_df= pd.DataFrame(pop_count_df)

pop_count_df= pop_count_df.rename(columns={(0): "Item ID", "Item ID": "Purchase Count"})
pop_count_df= pop_count_df.reset_index()
pop_count_df= pop_count_df.rename(columns={("index"): "Item ID", "Purchase Count": "Purchase Count"})
pop_count_df

     Item ID  Purchase Count
0        178              12
1         82               9
2        108               9
3        145               9
4         92               8
..       ...             ...
178       42               1
179      118               1
180      104               1
181       27               1
182       51               1

[183 rows x 2 columns]

In [345]:
pop_items_df= pop_items_df.groupby(['Item ID', 'Item Name','Price'])
print(pop_items_df)
pop_items_df.count().head()

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x111718050>

                                  Purchase ID  SN  Age  Gender
Item ID Item Name          Price
0       Splinter           1.28             4   4    4       4
1       Crucifer           3.26             3   3    3       3
2       Verdict            2.48             6   6    6       6
3       Phantomlight       2.49             6   6    6       6
4       Bloodlord's Fetish 1.70             5   5    5       5

In [350]:
item_total_df=pop_items_df["Price"].sum()
item_total_df= pd.DataFrame(item_total_df)
item_total_df= item_total_df.rename(columns={(0): "Item ID", "Price": "Total Purchase Value"})
item_total_df= item_total_df.reset_index()
item_total_df

     Item ID                        Item Name  Price  Total Purchase Value
0          0                         Splinter   1.28                  5.12
1          1                         Crucifer   3.26                  9.78
2          2                          Verdict   2.48                 14.88
3          3                     Phantomlight   2.49                 14.94
4          4               Bloodlord's Fetish   1.70                  8.50
..       ...                              ...    ...                   ...
178      179  Wolf, Promise of the Moonwalker   4.48                 26.88
179      180                      Stormcaller   3.36                  3.36
180      181                    Reaper's Toll   1.66                  8.30
181      182                        Toothpick   4.03                 12.09
182      183              Dragon's Greatsword   1.09                  3.27

[183 rows x 4 columns]

In [359]:
pop_analysis=pd.merge(item_total_df, pop_count_df, on="Item ID")

pop_analysis=pop_analysis.set_index(["Item ID", "Item Name"])
pop_analysis= pop_analysis.sort_values("Purchase Count", ascending=False)
pop_analysis = pop_analysis[["Purchase Count", "Price","Total Purchase Value"]]
pop_analysis.head()

,,Purchase Count,Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
145,Fiery Glass Crusader,9,4.58,41.22
108,"Extraction, Quickblade Of Trembling Hands",9,3.53,31.77
82,Nirvana,9,4.90,44.10
19,"Pursuit, Cudgel of Necromancy",8,1.02,8.16

In [360]:
profit_analysis= pop_analysis.sort_values("Total Purchase Value", ascending=False)
profit_analysis.head()

,,Purchase Count,Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
82,Nirvana,9,4.90,44.10
145,Fiery Glass Crusader,9,4.58,41.22
92,Final Critic,8,4.88,39.04
103,Singed Scalpel,8,4.35,34.80